# Отчет по лабораторной работе N 14 по курсу
# "Фундаментальная информатика"

Студент группы: M80-113Б, Агапов Владимир Сергеевич\
Контакты: agapow.volodya2018@gmail.com\
Работа выполнена: 11.03.2022\
Преподаватель: Довженко Анастасия Александровна


## 1. Тема

Вложенные циклы с параметрами. Обход и линеаризация матриц

## 2. Цель работы

Составить программу ввода квадратной матрицы и печати в строку всех её элементов в заданном ниже порядке следования (обхода)

## 3. Задание

Вариант 19. На вход подаётся пакет тестов, содержащий набор квадратных матриц. Каждую матрицу необходимо линеаризовать путём обхода всех её элементов согласно указанному в примере порядку следования (обход квадратами с угла

## 4. Оборудование

Процессор: Intel Core i5-10300H @ 4x 2.5GH\
ОП: 8000 Мб\
SSD: 256 Гб\
Монитор: 1920x1080\

## 5. Программное обеспечение

Операционная система семейства: **Windows**, версия **10**\
Система программирования: **CLion**, версия **2021.3**\

## 6. Идея, метод, алгоритм решения задачи

Считываем массив\
Заводим массив для направлений пути относительно i (для j будет такая же закономерность, только со сдвигом по массиву)\
Начинаем движение с центральных i, j\
Нужно учитывать, насколько увеличивается количество печатаемых элементов при каждом повороте\
i, j печатаемого элемента, с учетом направления движения в данный момент\
Печатаем элементы, учитывая в какую сторону мы идем\

## 7. Сценарий выполнения работы

| 1 | 2 | 9 | 10 |
|---|---|---|----|
| 4 | 3 | 8 | 11 |
| 5 | 6 | 7 | 12 |
| 16 | 15 | 14 | 13 |


## 8. Распечатка протокола
```
#include <stdio.h>

int main(void)
{
    int t, n, m, way[2] = {0, 1}, row, column, sign;
    scanf("%d %d", &t, &n);
    int mas[n][n];
    for (int cTest = 0; cTest < t; cTest++) {
        column = 0;
        row = -1;
        scanf("%d", &m);
        for (int i = 0; i < m; i++) {
            for (int j = 0; j < m; j++) {
                scanf("%d", &mas[i][j]);
            }
        }
        for (int i = 0, idx = 0; i < m; i++) {
            for (int j = 0; j < 2 * i + 1; j++) {
                if (j == 0 || j == 1 || j == i + 1) {
                    ++idx;
                }
                sign = j > i ? -1 : 1;
                row += way[idx % 2] * sign;
                column += way[(idx + 1) % 2] * sign;
                printf("%d ", mas[row][column]);
            }
        }
        printf("\n");
    }
    return 0;
}

```

## 9. Дневник отладки


| №  | Лаб. или дом. | Дата       | Время | Событие                  | Действие по исправлению | Примечание  |
|----|---------------|------------|-------|--------------------------|-------------------------|-------------|
| 1  | 
## 10. Замечания автора по существу работы

Замечаний нет.

## 11. Выводы

Научился лучше работать с массивами в СИ.
